# 引入numpy模块并创建两个向量x和y
import numpy as np
# x=np.array((0,0,1))
# y=np.array([-9.97555531e-04 ,-4.93735603e-03 , 9.99987314e-01])
# x=np.array((0,1,0))
# y=np.array([-0.14045077 , 0.99007628 , 0.00474831])
x=np.array((1,0,0))
y=np.array([-0.99008716 ,-0.14044425, -0.00168111])


#################################
# [-9.97555531e-04 -4.93735603e-03  9.99987314e-01]
# [-0.14045077  0.99007628  0.00474831]
# [-0.99008716 -0.14044425 -0.00168111]



# [[-9.97555531e-04 -1.40450766e-01 -9.90087161e-01]
#  [-4.93735603e-03  9.90076278e-01 -1.40444248e-01]
#  [ 9.99987314e-01  4.74831188e-03 -1.68111150e-03]]
#[-9.97555531e-04 -4.93735603e-03  9.99987314e-01]
# 分别计算两个向量的模：
l_x=np.sqrt(x.dot(x))
l_y=np.sqrt(y.dot(y))
print('向量的模=',l_x,l_y)

# 计算两个向量的点积
dian=x.dot(y)
print('向量的点积=',dian)

# 计算夹角的cos值：
cos_=dian/(l_x*l_y)
print('夹角的cos值=',cos_)

# 求得夹角（弧度制）：
angle_hu=np.arccos(cos_)
print('夹角（弧度制）=',angle_hu)

# 转换为角度值：
angle_d=angle_hu*180/np.pi
print('夹角=%f°'%angle_d)